Autodesk.Revit.UI.AToastNotification.SetIconType(Autodesk.Revit.UI.AToastNotificationIcon)
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.UI.AToastNotification.SetDuration(Autodesk.Revit.UI.AToastNotificationDuration)
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2020.1

Autodesk.Revit.UI.AToastNotification.Show
Shows the message as specified to the user.
Since:
2020.1

Autodesk.Revit.UI.AToastNotification.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.AToastNotification.TimerSeconds
How long does the notification stay on the screen? If negative or 0, the notification stays on unless closed by user.
Remarks:
The MS windows toast notification stays on the screen for seven seconds by default.
For notifications with long duration, it remains on the screen for twenty-five seconds.
We recommend this timer pattern for the sake of consistency.
Since:
2020.1

Autodesk.Revit.UI.AToastNotification.LinkURL
The linked URL.
Since:
2020.1

Autodesk.Revit.UI.AToastNotification.LinkText
The displayed text of the hyper link.
Since:
2020.1

Autodesk.Revit.UI.AToastNotification.Description
The descriptive text in the notification.
Since:
2020.1

Autodesk.Revit.UI.AToastNotification.ObjectName
The object name in the notification, displayed in bold text.
Since:
2020.1

Autodesk.Revit.UI.AToastNotification.#ctor
Constructs a new AToastNotification instance.
Remarks:
Show the message via Show() after setting the desired options.
Since:
2020.1

Autodesk.Revit.UI.AToastNotification
Represents a small message that shows up in the bottom right corner of Revit application frame.
Since:
2020.1